# CTRl + SHIFT + U -                смена регистра
# Ctrl + Alt + L -                  форматирование кода
# Ctrl + R -                        Поиск и замена
# Ctrl + Shift + Стрелка вверх -    перемещение блока вверх
# Ctrl + W -                        выделение текущего блока
# Ctrl + Shift + E              -   показ последнего блока кода, с которым работал
# F11 -                             установить закладку
# CTRL + Space                  -   Открывает команду для выбора команд
# CTRL + F                      -   Поиск по коду