###############    Пример Запроса и json загрузки  3##################
# import requests
# import json
#
# answer = requests.get("рандомный сайт")
# info = json.loads(answer.text)
# print(info)

######################################### ###########################

###################    Пример работы CSV  ############################
# import csv
# csv.reader()     - Чтение списка
# csv.DictReader() - Чтение через словарь
# csv.writer()     - запись через список
# csv.DictWriter   -  запись через словарь

# writeheader - Заголовочная строка
# writerow - одна строка
# writerows - много строк

# with open('рандомный файл с форматом.csv', 'режим', 'кодировка') as f:
#     file = csv.reader(f, delimiter='разделитель')
##################################################3